app/views/movies/search.html.erb

            <p class="text-gray-700 text-base mb-4">
              <span class="font-bold">Actors:</span> <%= movie.actors.map{|a| a.name}.join(', ') %>
---
SELECT "actors".* FROM "actors" INNER JOIN "movie_actors" ON "actors"."id" = "movie_actors"."actor_id" WHERE "movie_actors"."movie_id" = $1  [["movie_id", 1]]

            <p class="text-gray-700 text-base mb-4">
              <span class="font-bold">Directors:</span> <%= movie.directors.map{|a| a.name}.join(', ') %>
---
SELECT "directors".* FROM "directors" INNER JOIN "movie_directors" ON "directors"."id" = "movie_directors"."director_id" WHERE "movie_directors"."movie_id" = $1  [["movie_id", 1]]