app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY movies.rating desc
---
  def index
    @movies = Movie.all.order("movies.rating desc")

SELECT "movies".* FROM "movies" INNER JOIN "movie_actors" ON "movies"."id" = "movie_actors"."movie_id" WHERE "movie_actors"."actor_id" = $1  [["actor_id", 2]]
---
  def search
    actors = Actor.search(params[:actor])
    @movies = actors.map{|act| act.movies}.flatten.sort_by{ |obj| obj.rating }.reverse