app/models/review.rb

SELECT "reviews".* FROM "reviews"
UPDATE "movies" SET "rating" = $1 WHERE "movies"."id" = $2  [["rating", "0.0"], ["id", 1]]
---
  def update_movie_rating
    new_rating = self.movie.reviews.map{|rev| rev.rating}.sum
    self.movie.update_column(:rating, new_rating.to_f/5)